// 2. Напишите программу, которая будет выдавать название дня
// недели по заданному номеру.

Console.WriteLine("enter a number");
